doc/BUILD/source/_static/soap_outputs/6.5.314.4301/ask_manual_question_sensor_with_filter_and_3_options_step_4_request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <typens:tanium_soap_request xmlns:typens="urn:TaniumSOAP">
      <command>AddObject</command>
      <object_list>
        <question>
          <group>
            <filters></filters>
          </group>
          <selects>
            <select>
              <filter>
                <not_flag>0</not_flag>
                <all_times_flag>1</all_times_flag>
                <value>.*Windows.*</value>
                <ignore_case_flag>1</ignore_case_flag>
                <max_age_seconds>3600</max_age_seconds>
                <operator>RegexMatch</operator>
                <all_values_flag>1</all_values_flag>
                <sensor>
                  <hash>45421433</hash>
                </sensor>
              </filter>
              <sensor>
                <hash>45421433</hash>
              </sensor>
            </select>
          </selects>
        </question>
      </object_list>
      <options>
        <suppress_object_list>1</suppress_object_list>
      </options>
    </typens:tanium_soap_request>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>